In [1]:
import pandas as pd

df = pd.DataFrame(columns=["Name", "Age", "Height"])

In [2]:
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [5]:
df.loc[0] = ["David", 25, 180]

In [6]:
df

    Name  Age  Height
0  David   25     180

In [7]:
df.loc[1] = ["Allen", 22, 175]

In [8]:
df

    Name  Age  Height
0  David   25     180
1  Allen   22     175

In [9]:
df["Weight"] = [60, 70]

In [10]:
df

    Name  Age  Height  Weight
0  David   25     180      60
1  Allen   22     175      70

In [14]:
df.drop("Weight", axis=1)

    Name  Age  Height
0  David   25     180
1  Allen   22     175

In [15]:
df

    Name  Age  Height  Weight
0  David   25     180      60
1  Allen   22     175      70

In [16]:
df = df.drop("Weight", axis=1)
df

    Name  Age  Height
0  David   25     180
1  Allen   22     175

In [21]:
df = df.drop(index=1)

In [22]:
df

    Name  Age  Height
0  David   25     180

In [25]:
df2 = pd.DataFrame(
    data =[
        ["David", 25, 180],
        ["Allen", 22, 170],
        ["Ted", 23, 178]
    ],
    columns=["Name", "Age", "Height"]
)

In [29]:
df2

    Name  Age  Height
0  David   25     180
1  Allen   22     170
2    Ted   23     178